quyle-itr-intern/ProjectTXRX/00-STM32F103C8T6_LIBRARIES/lvq_stm32f4_pwm.c
/**
  ******************************************************************************

  PWM For SLVQ32F446RE
  Author:   LVQ
  Updated:  19st June 2022

  ******************************************************************************
*/

#include "lvq_stm32f4_pwm.h"

/* Private functions */
LVQ_PWM_Result_t LVQ_PWM_INT_InitTIM1Pins(LVQ_PWM_Channel_t Channel, LVQ_PWM_PinsPack_t PinsPack);
LVQ_PWM_Result_t LVQ_PWM_INT_InitTIM2Pins(LVQ_PWM_Channel_t Channel, LVQ_PWM_PinsPack_t PinsPack);
LVQ_PWM_Result_t LVQ_PWM_INT_InitTIM3Pins(LVQ_PWM_Channel_t Channel, LVQ_PWM_PinsPack_t PinsPack);
LVQ_PWM_Result_t LVQ_PWM_INT_InitTIM4Pins(LVQ_PWM_Channel_t Channel, LVQ_PWM_PinsPack_t PinsPack);
LVQ_PWM_Result_t LVQ_PWM_INT_InitTIM5Pins(LVQ_PWM_Channel_t Channel, LVQ_PWM_PinsPack_t PinsPack);
LVQ_PWM_Result_t LVQ_PWM_INT_InitTIM8Pins(LVQ_PWM_Channel_t Channel, LVQ_PWM_PinsPack_t PinsPack);
LVQ_PWM_Result_t LVQ_PWM_INT_InitTIM9Pins(LVQ_PWM_Channel_t Channel, LVQ_PWM_PinsPack_t PinsPack);
LVQ_PWM_Result_t LVQ_PWM_INT_InitTIM10Pins(LVQ_PWM_Channel_t Channel, LVQ_PWM_PinsPack_t PinsPack);
LVQ_PWM_Result_t LVQ_PWM_INT_InitTIM11Pins(LVQ_PWM_Channel_t Channel, LVQ_PWM_PinsPack_t PinsPack);
LVQ_PWM_Result_t LVQ_PWM_INT_InitTIM12Pins(LVQ_PWM_Channel_t Channel, LVQ_PWM_PinsPack_t PinsPack);
LVQ_PWM_Result_t LVQ_PWM_INT_InitTIM13Pins(LVQ_PWM_Channel_t Channel, LVQ_PWM_PinsPack_t PinsPack);
LVQ_PWM_Result_t LVQ_PWM_INT_InitTIM14Pins(LVQ_PWM_Channel_t Channel, LVQ_PWM_PinsPack_t PinsPack);

LVQ_TIMER_Result_t LVQ_TIMER_EnableClock(TIM_TypeDef* TIMx);
LVQ_TIMER_Result_t LVQ_TIMER_GetTimerProperties(TIM_TypeDef* TIMx, LVQ_TIMER_PROPERTIES_t* Timer_Data);
LVQ_TIMER_Result_t LVQ_TIMER_CreateDataForPWMFrequency(LVQ_TIMER_PROPERTIES_t* Timer_Data, double PWMFrequency);
LVQ_TIMER_Result_t LVQ_TIMER_OC(LVQ_PWM_TIM_t* TIM_Data, LVQ_PWM_Channel_t Channel);

LVQ_PWM_Result_t LVQ_PWM_SetDuty(LVQ_PWM_TIM_t* TIM_Data, LVQ_PWM_Channel_t Channel, uint32_t Pulse)
{
		/* Check pulse length */
    if (Pulse >= TIM_Data->Period) {
        /* Pulse too high */
        return LVQ_PWM_Result_PulseTooHigh;
    }
		uint8_t ch = (uint8_t)Channel;
		/* Save pulse value */
    TIM_Data->CH_Periods[ch] = Pulse;
		
		switch (Channel) 
		{
			case LVQ_PWM_Channel_1:
					TIM_SetCompare1(TIM_Data->TIM, Pulse);
					break;
			case LVQ_PWM_Channel_2:
					TIM_SetCompare2(TIM_Data->TIM, Pulse);
					break;
			case LVQ_PWM_Channel_3:
					TIM_SetCompare3(TIM_Data->TIM, Pulse);
					break;
			case LVQ_PWM_Channel_4:
					TIM_SetCompare4(TIM_Data->TIM, Pulse);
					break;
			default:
					break;
		}
		return LVQ_PWM_Result_Ok;
}

LVQ_PWM_Result_t LVQ_PWM_SetDutyPercent(LVQ_PWM_TIM_t* TIM_Data, LVQ_PWM_Channel_t Channel, float percent) 
{
    /* Check input value */
    if (percent > 100) {
        return LVQ_PWM_SetDuty(TIM_Data, Channel, TIM_Data->Period);
    } else if (percent <= 0) {
        return LVQ_PWM_SetDuty(TIM_Data, Channel, 0);
    }

    /* Set channel value */
    return LVQ_PWM_SetDuty(TIM_Data, Channel, (uint32_t)((float)(TIM_Data->Period - 1) * percent) / 100);
}

LVQ_PWM_Result_t LVQ_PWM_SetDutyMicros(LVQ_PWM_TIM_t* TIM_Data, LVQ_PWM_Channel_t Channel, uint32_t micros) 
{
    /* If we choose too much micro seconds that we have valid */
    if (micros > TIM_Data->Micros) {
        /* Too high pulse */
        return LVQ_PWM_Result_PulseTooHigh;
    }

    /* Set PWM channel */
    return LVQ_PWM_SetDuty(TIM_Data, Channel, (uint32_t)((TIM_Data->Period - 1) * micros) / TIM_Data->Micros);
}

LVQ_PWM_Result_t LVQ_PWM_InitTimer(TIM_TypeDef* TIMx, LVQ_PWM_TIM_t* TIM_Data, double PWMFrequency)
{
	  TIM_TimeBaseInitTypeDef TIM_BaseStruct;
		LVQ_TIMER_PROPERTIES_t Timer_Data;
	
	  /* Check valid timer */
    if (0
		#ifdef TIM6
						|| TIMx == TIM6
		#endif
		#ifdef TIM7
						|| TIMx == TIM7
		#endif
    ) {
        /* Timers TIM6 and TIM7 can not provide PWM feature */
        return LVQ_PWM_Result_TimerNotValid;
    }
		/* Save timer */
    TIM_Data->TIM = TIMx;
		
		LVQ_TIMER_GetTimerProperties(TIMx, &Timer_Data);
		/* Check for maximum timer frequency */
    if (PWMFrequency > Timer_Data.TimerFrequency) 
		{
        /* Frequency too high */
        return LVQ_PWM_Result_FrequencyTooHigh;
    } 
		else if (PWMFrequency == 0) 
		{
        /* Not valid frequency */
			return LVQ_PWM_Result_FrequencyTooLow;
    }
		
		/* Enable clock for Timer */
    LVQ_TIMER_EnableClock(TIMx);
		
		/* Generate settings */
		LVQ_TIMER_Result_t status = LVQ_TIMER_CreateDataForPWMFrequency(&Timer_Data, PWMFrequency);
		if(status == LVQ_TIMER_Result_FrequencyTooLow) return LVQ_PWM_Result_FrequencyTooLow;
		if(status == LVQ_TIMER_Result_FrequencyTooHigh) return LVQ_PWM_Result_FrequencyTooHigh;

		/* Data are OK */
		TIM_Data->Frequency = PWMFrequency;
    TIM_Data->Micros = 1000000 / PWMFrequency;
    TIM_Data->Period = Timer_Data.Period;
    TIM_Data->Prescaler = Timer_Data.Prescaler;
		
		/* Set timer options */
    TIM_BaseStruct.TIM_Prescaler = Timer_Data.Prescaler - 1;
    TIM_BaseStruct.TIM_CounterMode = TIM_CounterMode_Up;
    TIM_BaseStruct.TIM_Period = Timer_Data.Period - 1;
    TIM_BaseStruct.TIM_ClockDivision = TIM_CKD_DIV1;
    TIM_BaseStruct.TIM_RepetitionCounter = 0;

    /* Initialize timer */
    TIM_TimeBaseInit(TIMx, &TIM_BaseStruct);

    /* Preload enable */
    TIM_ARRPreloadConfig(TIMx, ENABLE);
		
		/* Additional for TIM1 and LVQM8 */
		if (0
#ifdef TIM1
        || TIMx == TIM1
#endif
#ifdef TIM8
        || TIMx == TIM8
#endif
       ) {
        /* Enable PWM outputs */
        TIM_CtrlPWMOutputs(TIMx, ENABLE);
    }
			 
		/* Start timer */
    TIM_Cmd(TIMx, ENABLE);  

    /* Set default values */
    TIM_Data->CH_Init = 0;

    /* Return OK */
    return LVQ_PWM_Result_Ok;	
}

LVQ_PWM_Result_t LVQ_PWM_InitChannel(LVQ_PWM_TIM_t* TIM_Data, LVQ_PWM_Channel_t Channel, LVQ_PWM_PinsPack_t PinsPack) 
{
		TIM_Data->CH_Init = Channel;
#ifdef TIM1
    if (TIM_Data->TIM == TIM1) {
				/* Initialize OC Timer */
				LVQ_TIMER_OC(TIM_Data, Channel);
        return LVQ_PWM_INT_InitTIM1Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM2
    if (TIM_Data->TIM == TIM2) {
				/* Initialize OC Timer */
				LVQ_TIMER_OC(TIM_Data, Channel);
        return LVQ_PWM_INT_InitTIM2Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM3
    if (TIM_Data->TIM == TIM3) {
				/* Initialize OC Timer */
				LVQ_TIMER_OC(TIM_Data, Channel);
        return LVQ_PWM_INT_InitTIM3Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM4
    if (TIM_Data->TIM == TIM4) {
				/* Initialize OC Timer */
				LVQ_TIMER_OC(TIM_Data, Channel);
        return LVQ_PWM_INT_InitTIM4Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM5
    if (TIM_Data->TIM == TIM5) {
				/* Initialize OC Timer */
				LVQ_TIMER_OC(TIM_Data, Channel);
        return LVQ_PWM_INT_InitTIM5Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM8
    if (TIM_Data->TIM == TIM8) {
				/* Initialize OC Timer */
				LVQ_TIMER_OC(TIM_Data, Channel);
        return LVQ_PWM_INT_InitTIM8Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM9
    if (TIM_Data->TIM == TIM9) {
				/* Initialize OC Timer */
				LVQ_TIMER_OC(TIM_Data, Channel);
        return LVQ_PWM_INT_InitTIM9Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM10
    if (TIM_Data->TIM == TIM10) {
				/* Initialize OC Timer */
				LVQ_TIMER_OC(TIM_Data, Channel);
        return LVQ_PWM_INT_InitTIM10Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM11
    if (TIM_Data->TIM == TIM11) {
				/* Initialize OC Timer */
				LVQ_TIMER_OC(TIM_Data, Channel);
        return LVQ_PWM_INT_InitTIM11Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM12
    if (TIM_Data->TIM == TIM12) {
				/* Initialize OC Timer */
				LVQ_TIMER_OC(TIM_Data, Channel);
        return LVQ_PWM_INT_InitTIM12Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM13
    if (TIM_Data->TIM == TIM13) {
				/* Initialize OC Timer */
				LVQ_TIMER_OC(TIM_Data, Channel);
        return LVQ_PWM_INT_InitTIM13Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM14
    if (TIM_Data->TIM == TIM14) {
				/* Initialize OC Timer */
				LVQ_TIMER_OC(TIM_Data, Channel);
        return LVQ_PWM_INT_InitTIM14Pins(Channel, PinsPack);
    }
#endif

    /* Timer is not valid */
    return LVQ_PWM_Result_TimerNotValid;
}

LVQ_TIMER_Result_t LVQ_TIMER_OC(LVQ_PWM_TIM_t* TIM_Data, LVQ_PWM_Channel_t Channel)
{
		TIM_OCInitTypeDef TIM_OCStruct;
		/* Common settings */
    TIM_OCStruct.TIM_Pulse = 0;
    TIM_OCStruct.TIM_OCMode = TIM_OCMode_PWM2;
    TIM_OCStruct.TIM_OutputState = TIM_OutputState_Enable;
    TIM_OCStruct.TIM_OCPolarity = TIM_OCPolarity_Low;
		
		/* Select proper channel */
    switch (Channel) {
        case LVQ_PWM_Channel_1:
                /* Init channel */
                TIM_OC1Init(TIM_Data->TIM, &TIM_OCStruct);
                TIM_OC1PreloadConfig(TIM_Data->TIM, TIM_OCPreload_Enable);
            break;
        case LVQ_PWM_Channel_2:
                /* Init channel */
                TIM_OC2Init(TIM_Data->TIM, &TIM_OCStruct);
                TIM_OC2PreloadConfig(TIM_Data->TIM, TIM_OCPreload_Enable);
            break;
        case LVQ_PWM_Channel_3:
                /* Init channel */
                TIM_OC3Init(TIM_Data->TIM, &TIM_OCStruct);
                TIM_OC3PreloadConfig(TIM_Data->TIM, TIM_OCPreload_Enable);
            break;
        case LVQ_PWM_Channel_4:
                /* Init channel */
                TIM_OC4Init(TIM_Data->TIM, &TIM_OCStruct);
                TIM_OC4PreloadConfig(TIM_Data->TIM, TIM_OCPreload_Enable);
            break;
        default:
								return LVQ_TIMER_Result_Error;
    }
		/* Return everything OK */
    return LVQ_TIMER_Result_Ok;
}

LVQ_TIMER_Result_t LVQ_TIMER_CreateDataForPWMFrequency(LVQ_TIMER_PROPERTIES_t* Timer_Data, double PWMFrequency) 
{
		if (PWMFrequency > Timer_Data->TimerFrequency) {
        /* Reset values */
        Timer_Data->Prescaler = 0;
        Timer_Data->Period = 0;
        Timer_Data->Frequency = 0;

        /* Frequency too high */
        return LVQ_TIMER_Result_FrequencyTooHigh;
    } else if (PWMFrequency == 0) {
        /* Reset values */
        Timer_Data->Prescaler = 0;
        Timer_Data->Period = 0;
        Timer_Data->Frequency = 0;

